const data = {
   mask: {
      title: 'الأقنعة',
      price: 1500, 
      maleMax: 232, 
      femaleMax: 226,
      skip: [
         73, 120, 132, 175, 221, 222, 224
      ]
   },
   hat: { 
      title: 'القبعات',
      price: 200, 
      maleMax: 203,
      femaleMax: 197,
      maleSkip: [11, 19, 46, 59, 89, 91, 92, 93, 112, 114, 116, 117, 118, 119, 123, 124, 125, 126, 144, 150, 199, 200, 201, 202],
      femaleSkip: [19, 45, 59, 62, 88, 90, 91, 92, 111, 113, 115, 116, 117, 118, 122, 123, 124, 125, 143, 148, 149]
   },
   glass: {
      title: 'النظارات',
      price: 100,
      maleMax: 52, 
      femaleMax: 54, 
      maleSkip: [1, 2, 3, 5, 6, 7, 11, 14, 27, 40, 49, 50],
      femaleSkip: [1, 2, 3, 5, 7, 13, 29, 42]
   },
   ear: { 
      title: 'الأذن',
      price: 50, 
      maleMax: 41, 
      femaleMax: 22, 
      maleSkip: [3, 4, 11, 12],
      femaleSkip: [3, 4, 5, 10, 11, 12, ]
   },
   torso: { 
      title: 'الجذوع',
      price: 0, 
      maleMax: 209, 
      femaleMax: 243, 
      maleSkip: [164, 169],
      femaleSkip: [205, 210]
   },
   undershirt: { 
      title: 'الداخلية',
      price: 50, 
      maleMax: 192, 
      femaleMax: 237, 
      maleSkip: [41, 42, 43, 44, 58, 97, 122, 123, 128, 129, 130, 131, 151, 153, 154, 155, 170, 172],
      femaleSkip: [35, 105, 152, 153, 158, 159, 160, 161, 187, 189, 190, 191, 207, ]
   },
   top: { 
      title: 'بلايز',
      price: 200, 
      maleMax: 492, 
      femaleMax: 531,
      maleSkip: [
         24, 31, 48, 54, 55, 186, 201, 246, 274, 275, 277, 278, 287, 289, 305, 306, 314, 315, 333, 397, 445, 446, 447, 448, 449, 452, 453, 
         454, 455, 456, 457, 458, 459, 460, 462, 465, 466, 468, 469, 470, 471, 474, 475, 476, 482, 483, 484, 487, 488, 489
      ],
      femaleSkip: [
         25, 47, 48, 88, 89, 90, 91, 203, 254, 287, 288, 290, 300, 325, 326, 331, 348, 420, 476, 478, 479, 480, 481, 482, 485, 486, 487, 488, 
         489, 490, 491, 492, 493, 495, 499, 500, 502, 503, 504, 505, 506, 509, 511, 512, 517, 518, 519, 520, 521, 522, 525, 526, 527
      ]
   },
   badge: { 
      title: 'الملصقات',
      price: 50, 
      maleMax: 129, 
      femaleMax: 139, 
      maleSkip: [],
      femaleSkip: []
   },
   bag: { 
      title: 'الحقائب',
      price: 5000, 
      values: [0, 45],
      maleMax: 1,
      femaleMax: 1
   },
   accessory: { 
      title: 'الملحقات',
      price: 50, 
      maleMax: 166, 
      femaleMax: 142, 
      maleSkip: [
         1, 2, 3, 5, 6, 7, 8, 9, 33, 40, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 95, 96, 97, 98, 99, 100, 101, 102,
         103, 104, 105, 106, 107, 108, 109, 125, 126, 127
      ],
      femaleSkip: [1, 2, 6, 8, 16, 24, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 74, 75, 76, 77, 78, 79, 80, 95, 96, 97, 98, 136, 137, 138, 139, 140]
   },
   watch: { 
      title: 'الساعات',
      price: 50, 
      maleMax: 46,
      femaleMax: 35,
      maleSkip: [],
      femaleSkip: [1]
   },
   bracelet: { 
      title: 'الأساور',
      price: 50, 
      maleMax: 13, 
      femaleMax: 20, 
      maleSkip: [],
      femaleSkip: []
   },
   leg: { 
      title: 'السراويل',
      price: 200, 
      maleMax: 176, 
      femaleMax: 190, 
      maleSkip: [95, 106, 108, 127, 145, 160, 161, 162, 163, 164, 165, 166, 167, 169, 171],
      femaleSkip: [51, 98, 115, 132, 171, 172, 173, 174, 175, 176, 177, 178, 179, 181, 183, 186, ]
   },
   shoe: { 
      title: 'أحذية',
      price: 150, 
      maleMax: 134, 
      femaleMax: 141, 
      maleSkip: [1, 127, 128, 129, 130, 131],
      femaleSkip: [133, 134, 135, 136, 138]
   }
}